import Alpine from "alpinejs";

const re = new RegExp("\\d+", "g");

Alpine.magic(
  "template",
  () => (data) =>
    applyTemplate(
      data
        .split("\n")
        .slice(3)
        .map((str) => str.match(re)?.slice(-5)),
    ),
);
Alpine.magic("clipboard", () => (data) => navigator.clipboard.writeText(data));
Alpine.start();

function applyTemplate(data) {
  if (!data) return "";
  return `=== 속성 ===
[include(틀:리버스: 1999/마도학자/속성,
희귀도=6성,

통찰0_레벨1_공격=${data[0][0]},
통찰0_레벨1_HP=${data[0][1]},
통찰0_레벨1_현실방어=${data[0][2]},
통찰0_레벨1_정신방어=${data[0][3]},
통찰0_레벨1_치명타기술=${data[0][4]},

통찰0_레벨30_공격=${data[1][0]},
통찰0_레벨30_HP=${data[1][1]},
통찰0_레벨30_현실방어=${data[1][2]},
통찰0_레벨30_정신방어=${data[1][3]},
통찰0_레벨30_치명타기술=${data[1][4]},

통찰1_레벨1_공격=${data[2][0]},
통찰1_레벨1_HP=${data[2][1]},
통찰1_레벨1_현실방어=${data[2][2]},
통찰1_레벨1_정신방어=${data[2][3]},
통찰1_레벨1_치명타기술=${data[2][4]},

통찰1_레벨40_공격=${data[3][0]},
통찰1_레벨40_HP=${data[3][1]},
통찰1_레벨40_현실방어=${data[3][2]},
통찰1_레벨40_정신방어=${data[3][3]},
통찰1_레벨40_치명타기술=${data[3][4]},

통찰2_레벨1_공격=${data[4][0]},
통찰2_레벨1_HP=${data[4][1]},
통찰2_레벨1_현실방어=${data[4][2]},
통찰2_레벨1_정신방어=${data[4][3]},
통찰2_레벨1_치명타기술=${data[4][4]},

통찰2_레벨50_공격=${data[5][0]},
통찰2_레벨50_HP=${data[5][1]},
통찰2_레벨50_현실방어=${data[5][2]},
통찰2_레벨50_정신방어=${data[5][3]},
통찰2_레벨50_치명타기술=${data[5][4]},

통찰3_레벨1_공격=${data[6][0]},
통찰3_레벨1_HP=${data[6][1]},
통찰3_레벨1_현실방어=${data[6][2]},
통찰3_레벨1_정신방어=${data[6][3]},
통찰3_레벨1_치명타기술=${data[6][4]},

통찰3_레벨60_공격=${data[7][0]},
통찰3_레벨60_HP=${data[7][1]},
통찰3_레벨60_현실방어=${data[7][2]},
통찰3_레벨60_정신방어=${data[7][3]},
통찰3_레벨60_치명타기술=${data[7][4]})]
`;
}
